import React from "react";
import { View, Text, StyleSheet, SafeAreaView, ScrollView } from "react-native";

function About() {
  <ScrollView style={{ flex: 1, alignItems: "center" }}>
    <View>
      <Text>
        Дори қидирув тизими, енг яқин дорихонада қиммат дори-дармонларга арзон
        аналогларни топинг. Дори-дармон нархини солиштиринг ва пулингизни
        тежанг! Дори-дармонлар нархи дорихонадан дорихонага қадар ўзгариб
        туради. Енг арзон дори-дармонларни топиш қийин, чунки нархларни
        таққослаш учун ҳеч қачон катта манбаа йўқ. Дорилар рўйхатини
        шифокорингиздан олинг ва енг арзон ва енг яқин дорихоналарни топиш учун
        ОсонAптекадан фойдаланинг. ОсонAптека рўйхат бўйича дори-дармонларни
        осонлик билан таққослаш имконини беради. Енг яқин дорихоналардан
        дори-дармонлар рўйхатида енг паст нархни топинг. ОсонAптека фойдаланиш
        учун 100% бепул - сиздан ҳеч қандай тўлов ёки мажбурият талаб
        қилинмайди. Оилангизнинг ҳар бир аъзосининг соғлиғини сақлаш орқали ҳам
        пулингизни тежанг. ОсонAптека иловасининг хусусиятлари: - 25 мингдан
        ортиқ дори воситалари - Дори-дармонларни номи орқали излаш - Ушбу восита
        йўриқномасидан асосий маълумотларни кўриш - Яқин дорихоналардан
        дориларни рўйхат орқали қидириш. - Нархларни солиштириш ва енг яхши
        нархни топиш. ОсонAптека билан дори-дармонлар учун маблағингизни тежашни
        бошланг!
      </Text>
    </View>
  </ScrollView>;
}

export default About;
